esp8266/Arduino/libraries/ESP8266WiFi/src/WiFiClientSecureBearSSL.cpp
/*
  WiFiClientBearSSL- SSL client/server for esp8266 using BearSSL libraries
  - Mostly compatible with Arduino WiFi shield library and standard
    WiFiClient/ServerSecure (except for certificate handling).

  Copyright (c) 2018 Earle F. Philhower, III

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#define LWIP_INTERNAL

#include <list>
#include <errno.h>
#include <algorithm>

extern "C" {
#include "osapi.h"
#include "ets_sys.h"
}
#include "debug.h"
#include "ESP8266WiFi.h"
#include "WiFiClient.h"
#include "WiFiClientSecureBearSSL.h"
#include "lwip/opt.h"
#include "lwip/ip.h"
#include "lwip/tcp.h"
#include "lwip/inet.h"
#include "lwip/netif.h"
#include "include/ClientContext.h"
#include "c_types.h"

namespace BearSSL {

// BearSSL needs a very large stack, larger than the entire ESP8266 Arduino
// default one.  This shared_pointer is allocated on first use and cleared
// on last cleanup, with only one stack no matter how many SSL objects.
std::shared_ptr<uint8_t> WiFiClientBearSSL::_bearssl_stack = nullptr;



void WiFiClientBearSSL::_clear() {
  // TLS handshake may take more than the 5 second default timeout
  _timeout = 15000;

  _sc = nullptr;
  _sc_svr = nullptr;
  _eng = nullptr;
  _x509_minimal = nullptr;
  _x509_insecure = nullptr;
  _x509_knownkey = nullptr;
  _iobuf_in = nullptr;
  _iobuf_out = nullptr;
  _now = 0; // You can override or ensure time() is correct w/configTime
  _ta = nullptr;
  setBufferSizes(16384, 512); // Minimum safe
  _handshake_done = false;
  _recvapp_buf = nullptr;
  _recvapp_len = 0;
  _oom_err = false;
}

void WiFiClientBearSSL::_clearAuthenticationSettings() {
  _use_insecure = false;
  _use_fingerprint = false;
  _use_self_signed = false;
  _knownkey = nullptr;
  _sk = nullptr;
}


WiFiClientBearSSL::WiFiClientBearSSL() : WiFiClient() {
  _clear();
  _clearAuthenticationSettings();
  _certStore = nullptr; // Don't want to remove cert store on a clear, should be long lived
  if (!_bearssl_stack) {
    #if 1
    const int stacksize = 4500; // Empirically determined stack for EC and RSA connections
    _bearssl_stack = std::shared_ptr<uint8_t>(new uint8_t[stacksize], std::default_delete<uint8_t[]>());
    br_esp8266_stack_proxy_init(_bearssl_stack.get(), stacksize);
    #else
    // TODO - DANGEROUS - EVIL
    // Steal memory from the SYS stack instead of allocating HEAP
    const int stacksize = 0x1200; // Empirically determined stack for EC and RSA connections
    _bearssl_stack = std::shared_ptr<uint8_t>(new uint8_t[1 /* just placeholder, real space is sys_space */], std::default_delete<uint8_t[]>());
    uint8_t *sys_space = (uint8_t*)0x3fffe000;
    br_esp8266_stack_proxy_init(sys_space, stacksize);
    #endif
  }
  _local_bearssl_stack = _bearssl_stack;
}

WiFiClientBearSSL::~WiFiClientBearSSL() {
  if (_client) {
    _client->unref();
    _client = nullptr;
  }
  _freeSSL();
  _local_bearssl_stack = nullptr; // Potentially delete it if we're the last SSL object
}

WiFiClientBearSSL::WiFiClientBearSSL(ClientContext* client,
                                     const BearSSLX509List *chain, const BearSSLPrivateKey *sk,
                                     int iobuf_in_size, int iobuf_out_size, const BearSSLX509List *client_CA_ta) {
  _clear();
  _clearAuthenticationSettings();
  _iobuf_in_size = iobuf_in_size;
  _iobuf_out_size = iobuf_out_size;
  _client = client;
  _client->ref();
  if (!_connectSSLServerRSA(chain, sk, client_CA_ta)) {
    _client->unref();
    _client = nullptr;
    _clear();
  }
}

WiFiClientBearSSL::WiFiClientBearSSL(ClientContext *client,
                                     const BearSSLX509List *chain,
                                     unsigned cert_issuer_key_type, const BearSSLPrivateKey *sk,
                                     int iobuf_in_size, int iobuf_out_size, const BearSSLX509List *client_CA_ta) {
  _clear();
  _clearAuthenticationSettings();
  _iobuf_in_size = iobuf_in_size;
  _iobuf_out_size = iobuf_out_size;
  _client = client;
  _client->ref();
  if (!_connectSSLServerEC(chain, cert_issuer_key_type, sk, client_CA_ta)) {
    _client->unref();
    _client = nullptr;
    _clear();
  }
}

void WiFiClientBearSSL::setClientRSACert(const BearSSLX509List *chain, const BearSSLPrivateKey *sk) {
  _chain = chain;
  _sk = sk;
}

void WiFiClientBearSSL::setClientECCert(const BearSSLX509List *chain,
                                        const BearSSLPrivateKey *sk, unsigned allowed_usages, unsigned cert_issuer_key_type) {
  _chain = chain;
  _sk = sk;
  _allowed_usages = allowed_usages;
  _cert_issuer_key_type = cert_issuer_key_type;
}

void WiFiClientBearSSL::setBufferSizes(int recv, int xmit) {
  // Following constants taken from bearssl/src/ssl/ssl_engine.c (not exported unfortunately)
  const int MAX_OUT_OVERHEAD = 85;
  const int MAX_IN_OVERHEAD = 325;

  // The data buffers must be between 512B and 16KB
  recv = std::max(512, std::min(16384, recv));
  xmit = std::max(512, std::min(16384, xmit));

  // Add in overhead for SSL protocol
  recv += MAX_IN_OVERHEAD;
  xmit += MAX_OUT_OVERHEAD;
  _iobuf_in_size = recv;
  _iobuf_out_size = xmit;
}

void WiFiClientBearSSL::stop() {
  flush();
  if (_client) {
    _client->wait_until_sent();
    _client->abort();
  }
  WiFiClient::stop();
  _freeSSL();
}

void WiFiClientBearSSL::flush() {
  (void) _run_until(BR_SSL_SENDAPP);
  WiFiClient::flush();
}

int WiFiClientBearSSL::connect(IPAddress ip, uint16_t port) {
  if (!WiFiClient::connect(ip, port)) {
    return 0;
  }
  return _connectSSL(nullptr);
}

int WiFiClientBearSSL::connect(const char* name, uint16_t port) {
  IPAddress remote_addr;
  if (!WiFi.hostByName(name, remote_addr)) {
    return 0;
  }
  if (!WiFiClient::connect(remote_addr, port)) {
    return 0;
  }
  return _connectSSL(name);
}

